package observer

/*
Наблюдатель
Также известен как: Издатель-Подписчик, Слушатель, Observer

 Суть паттерна

Наблюдатель — это поведенческий паттерн проектирования, который создаёт механизм подписки, позволяющий одним объектам
следить и реагировать на события, происходящие в других объектах.
*/

/*
Проблема

Представьте, что вы имеете два объекта: Покупатель и Магазин. В магазин вот-вот должны завезти новый товар,
который интересен покупателю.

Покупатель может каждый день ходить в магазин, чтобы проверить наличие товара. Но при этом он будет злиться,
без толку тратя своё драгоценное время.

С другой стороны, магазин может разослать спам каждому своему покупателю. Многих это расстроит, так как товар
специфический, и не всем он нужен.

Получается конфликт: либо покупатель тратит время на периодические проверки, либо магазин тратит ресурсы
на бесполезные оповещения.
*/

/*
Решение

Давайте называть Издателями те объекты, которые содержат важное или интересное для других состояние.
Остальные объекты, которые хотят отслеживать изменения этого состояния, назовём Подписчиками.

Паттерн Наблюдатель предлагает хранить внутри объекта издателя список ссылок на объекты подписчиков,
причём издатель не должен вести список подписки самостоятельно. Он предоставит методы, с помощью которых подписчики
могли бы добавлять или убирать себя из списка.

image_1.png

Теперь самое интересное. Когда в издателе будет происходить важное событие, он будет проходиться по списку подписчиков
и оповещать их об этом, вызывая определённый метод объектов-подписчиков.

Издателю безразлично, какой класс будет иметь тот или иной подписчик, так как все они должны следовать общему
интерфейсу и иметь единый метод оповещения.

image_2.png

Увидев, как складно всё работает, вы можете выделить общий интерфейс, описывающий методы подписки и отписки,
и для всех издателей. После этого подписчики смогут работать с разными типами издателей, а также получать оповещения
от них через один и тот же метод.
*/

/*
 Аналогия из жизни
После того как вы оформили подписку на газету или журнал, вам больше не нужно ездить в супермаркет и проверять,
не вышел ли очередной номер. Вместо этого издательство будет присылать новые номера по почте прямо к вам домой
сразу после их выхода.

Издательство ведёт список подписчиков и знает, кому какой журнал высылать. Вы можете в любой момент отказаться от
подписки, и журнал перестанет вам приходить.
*/

/*
Структура

image_3.png
*/

/*
Применимость

1. Когда после изменения состояния одного объекта требуется что-то сделать в других, но вы не знаете наперёд, какие
именно объекты должны отреагировать.

- Описанная проблема может возникнуть при разработке библиотек пользовательского интерфейса, когда вам надо дать
возможность сторонним классам реагировать на клики по кнопкам.

Паттерн Наблюдатель позволяет любому объекту с интерфейсом подписчика зарегистрироваться на получение оповещений
о событиях, происходящих в объектах-издателях.

2. Когда одни объекты должны наблюдать за другими, но только в определённых случаях.

- Издатели ведут динамические списки. Все наблюдатели могут подписываться или отписываться от получения оповещений
прямо во время выполнения программы.
*/

/*
Шаги реализации

1. Разбейте вашу функциональность на две части: независимое ядро и опциональные зависимые части.
Независимое ядро станет издателем. Зависимые части станут подписчиками.

2. Создайте интерфейс подписчиков. Обычно в нём достаточно определить единственный метод оповещения.

3. Создайте интерфейс издателей и опишите в нём операции управления подпиской.
Помните, что издатель должен работать только с общим интерфейсом подписчиков.

3. Вам нужно решить, куда поместить код ведения подписки, ведь он обычно бывает одинаков для всех типов издателей.
Самый очевидный способ — вынести этот код в промежуточный абстрактный класс, от которого будут наследоваться все издатели.

4. Но если вы интегрируете паттерн в существующие классы, то создать новый базовый класс может быть затруднительно.
В этом случае вы можете поместить логику подписки во вспомогательный объект и делегировать ему работу из издателей.

5. Создайте классы конкретных издателей. Реализуйте их так, чтобы после каждого изменения состояния они отправляли
оповещения всем своим подписчикам.

6. Реализуйте метод оповещения в конкретных подписчиках. Не забудьте предусмотреть параметры, через которые издатель
мог бы отправлять какие-то данные, связанные с происшедшим событием.

Возможен и другой вариант, когда подписчик, получив оповещение, сам возьмёт из объекта издателя нужные данные.
Но в этом случае вы будете вынуждены привязать класс подписчика к конкретному классу издателя.

7. Клиент должен создавать необходимое количество объектов подписчиков и подписывать их у издателей.
*/

/*
Преимущества
- Издатели не зависят от конкретных классов подписчиков и наоборот.
- Вы можете подписывать и отписывать получателей на лету.
- Реализует принцип открытости/закрытости.
*/

/*
Недостатки
- Подписчики оповещаются в случайном порядке.
*/

/*
Отношения с другими паттернами

1. Цепочка обязанностей, Команда, Посредник и Наблюдатель показывают различные способы работы отправителей запросов
с их получателями:

- Цепочка обязанностей передаёт запрос последовательно через цепочку потенциальных получателей, ожидая, что какой-то
из них обработает запрос.
- Команда устанавливает косвенную одностороннюю связь от отправителей к получателям.
- Посредник убирает прямую связь между отправителями и получателями, заставляя их общаться опосредованно, через себя.
- Наблюдатель передаёт запрос одновременно всем заинтересованным получателям, но позволяет им динамически подписываться
или отписываться от таких оповещений.

2. Разница между Посредником и Наблюдателем не всегда очевидна. Чаще всего они выступают как конкуренты,
но иногда могут работать вместе.

- Цель Посредника — убрать обоюдные зависимости между компонентами системы. Вместо этого они становятся зависимыми
от самого посредника. С другой стороны, цель Наблюдателя — обеспечить динамическую одностороннюю связь, в которой одни
объекты косвенно зависят от других.

- Довольно популярна реализация Посредника при помощи Наблюдателя. При этом объект посредника будет выступать издателем,
а все остальные компоненты станут подписчиками и смогут динамически следить за событиями, происходящими в посреднике. В этом случае трудно понять, чем же отличаются оба паттерна.

- Но Посредник имеет и другие реализации, когда отдельные компоненты жёстко привязаны к объекту посредника. Такой код
вряд ли будет напоминать Наблюдателя, но всё же останется Посредником.

- Напротив, в случае реализации посредника с помощью Наблюдателя представим такую программу, в которой каждый компонент
системы становится издателем. Компоненты могут подписываться друг на друга, в то же время не привязываясь к конкретным классам. Программа будет состоять из целой сети Наблюдателей, не имея центрального объекта-Посредника.
*/
